app/views/games/index.html.erb

SELECT COUNT(*) FROM "add_ons" WHERE "add_ons"."game_id" = $1  [["game_id", 1]]
---
            <%= link_to(game.name, game) %><br />
            <span class="text-muted"><%= pluralize(game.add_ons.count, "Add On") %></span>