app/controllers/add_ons_controller.rb

  def create
    @add_on = @game.add_ons.new(add_on_params)

    respond_to do |format|
      if @add_on.save
---
INSERT INTO "add_ons" ("game_id", "title", "description", "cost_cents", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["game_id", 1], ["title", "Raccoon Suit"], ["description", "Leaf Powerup"], ["cost_cents", 475], ["created_at", 2016-09-24 04:36:49 UTC], ["updated_at", 2016-09-24 04:36:49 UTC]]

    def set_add_on
      @add_on = @game.add_ons.find(params[:id])
---
SELECT  "add_ons".* FROM "add_ons" WHERE "add_ons"."game_id" = $1 AND "add_ons"."id" = $2 LIMIT $3  [["game_id", 1], ["id", 1], ["LIMIT", 1]]

    def find_game
      @game = Game.find(params[:game_id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]