app/controllers/games_controller.rb

INSERT INTO "games" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Mario"], ["created_at", 2016-09-24 04:36:32 UTC], ["updated_at", 2016-09-24 04:36:32 UTC]]
---
  def create
    @game = Game.new(game_params)
    if @game.save

SELECT "games".* FROM "games" ORDER BY "games"."name" ASC
---
  def index
    @games = Game.order(name: :asc)

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_game
    @game = Game.find(params[:id])