app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "user1"], ["password", "pass"], ["email", "example@example.com"], ["created_at", 2016-09-25 03:20:16 UTC], ["updated_at", 2016-09-25 03:20:16 UTC]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
  def index
    @user = User.order(name: :asc)

UPDATE "users" SET "username" = $1, "password" = $2, "email" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["username", "user12"], ["password", "pass1"], ["email", "examp1le@example.com"], ["updated_at", 2016-09-25 19:07:46 UTC], ["id", 1]]
---
  def update
    @user.update(user_params)